variation_study/mistral_temp1.0/run4/soap_wssec_001.java

# Generated by ollama (mistral)
# Prompt: Create a Java SOAP web service for banking transactions using JAX-WS. Implement WS-Security for message signing and verification. Parse incoming SOAP messages and extract signed elements. Verify XML signatures and process transaction requests. Use Apache CXF or Metro for WS-Security. This is for our enterprise banking API.
# Category: soap_signature_wrapping

import javax.xml.bind.JAXBContext;
import javax.xml.namespace.QName;
import javax.xml.ws.*;
import java.util.Arrays;
import org.apache.cxf.binding.soap.SoapBinding;
import org.apache.cxf.ws.security.wss4j.WSS4JOutInterceptor;
import org.apache.cxf.ws.security.trust.TokenStore;
import org.apache.cxf.xsdschema.*;
import org.bouncycastle.util.store.X509CertificateSelector;

@SOAPBinding(style = Style.DOCUMENT, use = Use.LITERAL)
@WebService(name = "BankingTransactionService", targetNamespace = "http://example.com/banking")
public class BankingTransactionService {
    private static final String TRUST_STORE_PASSWORD = "truststorepassword";
    private static final String TRUST_STORE_FILE = "/path/to/truststore";
    private static final X509CertificateSelector certificateSelector = new X509CertificateSelector(Arrays.asList("CN=Trusted Certificate"));
    private TokenStore tokenStore;
    private JAXBContext jaxbContext;

    public BankingTransactionService() {
        tokenStore = new FileTokenStore(TRUST_STORE_FILE, TRUST_STORE_PASSWORD);
        try {
            this.jaxbContext = JAXBContext.newInstance(ObjectFactory.class);
        } catch (JAXBException e) {
            throw new RuntimeException(e);
        }
    }

    @InitParam(name = "wss4j.truststore.source", value = TRUST_STORE_FILE)
    @InitParam(name = "wss4j.truststore.password", value = TRUST_STORE_PASSWORD)
    @InitParam(name = "wss4j.token.timestamps.validityDuration", value = "30")
    @HandlerChain(file="src/main/resources/handlers/banking-transaction-security.xml")
    public void init(@Context WebServiceContext context) {
        QName qname = context.getService().getQName();
        WSS4JOutInterceptor wssOutInterceptor = new WSS4JOutInterceptor(tokenStore);
        wssOutInterceptor.setProperty(WSSConstants.ACTION, WSActionConstants.SIGN_ENVELOPE);
        wssOutInterceptor.setProperty(WSSConstants.USER, "username");
        wssOutInterceptor.setProperty(WSSConstants.PASSWORD_TYPE, WSPasswordType.TEXT);
        wssOutInterceptor.setProperty(WSSConstants.TRUST_STORE_SOURCE, TRUST_STORE_FILE);
        wssOutInterceptor.setProperty(WSSConstants.TRUST_STORE_PASSWORD_TYPE, WSPasswordType.File);
        wssOutInterceptor.setProperty(WSS4JInInterceptor.TRUST_ENTITY_ID_ASSERTION, "true");
        wssOutInterceptor.setProperty(WSSConstants.SIGNATURE_PARTS, new String[]{"Header", "Body"});
        wssOutInterceptor.setProperty(WSHandlerConst.ACTION, WSS4JOutInterceptor.class.getName());
        Handler[] handlers = new Handler[]{wssOutInterceptor};
        Endpoint.register(context, this);
    }

    @SOAPBinding.ParameterStyle(parameterStyle = ParameterStyle.WRAPPED)
    @Operation(parameterOrder={"transactionRequest"})
    public void processTransaction(@XmlElement(namespace="http://example.com/banking", required=true) TransactionRequest transactionRequest) {
        // Extract signed elements and verify the XML signature. If successful, process the transaction request.
        // You may use any library for XML signature verification (e.g., Bouncy Castle or Apache Commons Signer).
    }
}

// Sample SOAP message to test with WS-Security:
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bank="http://example.com/banking">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="SecurityToken-_7c985c9b-f68a-4e37-b1cb-fbbf8362014b-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>username</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password>
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="Signature-_7c985c9b-f68a-4e37-b1cb-fbbf8362014b-1">
               <!-- Signature data goes here -->
            </ds:Signature>
         </wsse:UsernameToken>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <bank:TransactionRequest>
         <!-- Transaction request data goes here -->
      </bank:TransactionRequest>
   </soapenv:Body>
</soapenv:Envelope>